## Working with Missing Data in Pandas

In [1]:
import numpy as np
import pandas as pd

from pandas import DataFrame

### Filling missing values using fillna(), replace() and interpolate()

In [4]:
data = {'name':['John','Paul','George','Ringo'],
        'age':[24,24,22,26],
        'gender':['male','male','male','male'],
        'rank':[1,2,3,4]}
ranking_df = DataFrame(data)
ranking_df.iloc[2:4,1] = np.nan
ranking_df

     name   age gender  rank
0    John  24.0   male     1
1    Paul  24.0   male     2
2  George   NaN   male     3
3   Ringo   NaN   male     4

In [5]:
ranking_df.isnull()

    name    age  gender   rank
0  False  False   False  False
1  False  False   False  False
2  False   True   False  False
3  False   True   False  False

In [6]:
ranking_df.notnull()

   name    age  gender  rank
0  True   True    True  True
1  True   True    True  True
2  True  False    True  True
3  True  False    True  True

In [7]:
bool_series = pd.isnull(ranking_df['age'])
ranking_df[bool_series]

     name  age gender  rank
2  George  NaN   male     3
3   Ringo  NaN   male     4

In [8]:
ranking_df.fillna(0)

     name   age gender  rank
0    John  24.0   male     1
1    Paul  24.0   male     2
2  George   0.0   male     3
3   Ringo   0.0   male     4

In [9]:
ranking_df.fillna(method='pad')

/tmp/ipykernel_11164/2647120121.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  ranking_df.fillna(method='pad')

     name   age gender  rank
0    John  24.0   male     1
1    Paul  24.0   male     2
2  George  24.0   male     3
3   Ringo  24.0   male     4